veryneo/stm32_cmake_project/driver/bsp/p_nucleo_wb55/src/bsp_nfc07a1.c
/**************************************************************
**  Include
**************************************************************/

#include "bsp_nfc07a1.h"

#include "stm32wbxx_hal.h"


/**************************************************************
** Symbol
**************************************************************/

#define D_BSP_NFC07A1_I2C_INSTANCE                          I2C1

#define D_BSP_NFC07A1_I2C_CLK_ENABLE()                      __HAL_RCC_I2C1_CLK_ENABLE()
#define D_BSP_NFC07A1_I2C_CLK_DISABLE()                     __HAL_RCC_I2C1_CLK_DISABLE()

#define D_BSP_NFC07A1_I2C_SCL_GPIO_PORT                     GPIOB
#define D_BSP_NFC07A1_I2C_SCL_GPIO_PIN                      GPIO_PIN_8
#define D_BSP_NFC07A1_I2C_SCL_GPIO_CLK_ENABLE()             __HAL_RCC_GPIOB_CLK_ENABLE()
#define D_BSP_NFC07A1_I2C_SCL_GPIO_CLK_DISABLE()            __HAL_RCC_GPIOB_CLK_DISABLE()
#define D_BSP_NFC07A1_I2C_SCL_GPIO_AF                       GPIO_AF4_I2C1

#define D_BSP_NFC07A1_I2C_SCA_GPIO_PORT                     GPIOB
#define D_BSP_NFC07A1_I2C_SCA_GPIO_PIN                      GPIO_PIN_9
#define D_BSP_NFC07A1_I2C_SCA_GPIO_CLK_ENABLE()             __HAL_RCC_GPIOB_CLK_ENABLE()
#define D_BSP_NFC07A1_I2C_SCA_GPIO_CLK_DISABLE()            __HAL_RCC_GPIOB_CLK_DISABLE()
#define D_BSP_NFC07A1_I2C_SCA_GPIO_AF                       GPIO_AF4_I2C1


#define D_BSP_NFC07A1_LED_NUM                               (3)

#define D_BSP_NFC07A1_LED1_GPIO_PORT                        GPIOA
#define D_BSP_NFC07A1_LED1_PIN                              GPIO_PIN_15
#define D_BSP_NFC07A1_LED1_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOA_CLK_ENABLE()
#define D_BSP_NFC07A1_LED1_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOA_CLK_DISABLE()

#define D_BSP_NFC07A1_LED2_GPIO_PORT                        GPIOC
#define D_BSP_NFC07A1_LED2_PIN                              GPIO_PIN_10
#define D_BSP_NFC07A1_LED2_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOC_CLK_ENABLE()
#define D_BSP_NFC07A1_LED2_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOC_CLK_DISABLE()

#define D_BSP_NFC07A1_LED3_GPIO_PORT                        GPIOC
#define D_BSP_NFC07A1_LED3_PIN                              GPIO_PIN_6
#define D_BSP_NFC07A1_LED3_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOC_CLK_ENABLE()
#define D_BSP_NFC07A1_LED3_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOC_CLK_DISABLE()

#define D_BSP_NFC07A1_LEDx_GPIO_CLK_ENABLE(__LED__)         do                                                                      \
                                                            {                                                                       \
                                                                if ( (__LED__) == E_BSP_NFC07A1_LED1) D_BSP_NFC07A1_LED1_GPIO_CLK_ENABLE();         \
                                                                else if ( (__LED__) == E_BSP_NFC07A1_LED2) D_BSP_NFC07A1_LED2_GPIO_CLK_ENABLE();    \
                                                                else if ( (__LED__) == E_BSP_NFC07A1_LED3) D_BSP_NFC07A1_LED3_GPIO_CLK_ENABLE();    \
                                                            } while (0)


#define D_BSP_NFC07A1_GPO_GPIO_PORT                         GPIOA
#define D_BSP_NFC07A1_GPO_GPIO_PIN                          GPIO_PIN_6
#define D_BSP_NFC07A1_GPO_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOA_CLK_ENABLE()
#define D_BSP_NFC07A1_GPO_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOA_CLK_DISABLE()
#define D_BSP_NFC07A1_GPO_EXTI_NUM                          EXTI9_5_IRQn
#define D_BSP_NFC07A1_GPO_EXTI_PRIORITY                     (0)


#define D_BSP_I2C_POLL_TIMEOUT                              (0x1000)


/**************************************************************
** Sturcture
**************************************************************/

typedef struct
{
    ST25DVxxKC_Object_t     nfctag_obj;
    ST25DVxxKC_Drv_t*       p_nfctag_drv;
    I2C_HandleTypeDef       i2c_handle;
    uint8_t                 gpo_activeFlag;
} S_BSP_NFC07A1_HANDLE_T;


/**************************************************************
** Variable
**************************************************************/

static GPIO_TypeDef*    gs_bsp_nfc07a1_led_port[D_BSP_NFC07A1_LED_NUM] = {D_BSP_NFC07A1_LED1_GPIO_PORT, D_BSP_NFC07A1_LED2_GPIO_PORT, D_BSP_NFC07A1_LED3_GPIO_PORT};
static const uint16_t   gs_bsp_nfc07a1_led_pin[D_BSP_NFC07A1_LED_NUM]  = {D_BSP_NFC07A1_LED1_PIN, D_BSP_NFC07A1_LED2_PIN, D_BSP_NFC07A1_LED3_PIN};

static S_BSP_NFC07A1_HANDLE_T gs_bsp_nfc07a1_handle = {0};


/**************************************************************
** Function Prototype
**************************************************************/

static int32_t bsp_nfc07a1_nfctag_i2C_init(void);
static int32_t bsp_nfc07a1_nfctag_i2c_deInit(void);
static int32_t bsp_nfc07a1_nfctag_i2c_isReady(uint16_t dev_addr, uint32_t trials);
// static int32_t bsp_nfc07a1_nfctag_i2c_reg_write(uint16_t dev_addr, uint16_t reg, uint8_t *p_data, uint16_t length);
// static int32_t bsp_nfc07a1_nfctag_i2c_reg_read(uint16_t dev_addr, uint16_t reg, uint8_t *p_data, uint16_t length);
static int32_t bsp_nfc07a1_nfctag_i2c_reg16_write(uint16_t dev_addr, uint16_t reg, uint8_t *p_data, uint16_t length);
static int32_t bsp_nfc07a1_nfctag_i2c_reg16_read(uint16_t dev_addr, uint16_t reg, uint8_t *p_data, uint16_t length);
// static int32_t bsp_nfc07a1_nfctag_i2c_transmit(uint16_t dev_addr, uint8_t *p_data, uint16_t length);
// static int32_t bsp_nfc07a1_nfctag_i2c_receive(uint16_t dev_addr, uint8_t *p_data, uint16_t length);
static int32_t bsp_nfc07a1_nfctag_tick_get(void);


/**************************************************************
** Interface
**************************************************************/

extern int32_t bsp_nfc07a1_nfctag_init(void)
{
    ST25DVxxKC_IO_t io = {0};

    io.Init     =   (ST25DVxxKC_Init_Func)bsp_nfc07a1_nfctag_i2C_init;   
    io.DeInit   =   (ST25DVxxKC_DeInit_Func)bsp_nfc07a1_nfctag_i2c_deInit;
    io.IsReady  =   (ST25DVxxKC_IsReady_Func)bsp_nfc07a1_nfctag_i2c_isReady;
    io.Read     =   (ST25DVxxKC_Read_Func)bsp_nfc07a1_nfctag_i2c_reg16_read;
    io.Write    =   (ST25DVxxKC_Write_Func)bsp_nfc07a1_nfctag_i2c_reg16_write;
    io.GetTick  =   (ST25DVxxKC_GetTick_Func)bsp_nfc07a1_nfctag_tick_get;

    if (ST25DVxxKC_RegisterBusIO(&(gs_bsp_nfc07a1_handle.nfctag_obj) , &io) != NFCTAG_OK)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }

    gs_bsp_nfc07a1_handle.p_nfctag_drv = (ST25DVxxKC_Drv_t*)(void*)&St25Dvxxkc_Drv;
    if (gs_bsp_nfc07a1_handle.p_nfctag_drv->Init != NULL)
    {
        if (gs_bsp_nfc07a1_handle.p_nfctag_drv->Init(&(gs_bsp_nfc07a1_handle.nfctag_obj) ) != NFCTAG_OK)
        {
            gs_bsp_nfc07a1_handle.p_nfctag_drv = NULL;
            return D_BSP_RET_NFCTAG_ERR;
        }
        else
        {
            return D_BSP_RET_OK;
        }
    }
    else 
    {
        gs_bsp_nfc07a1_handle.p_nfctag_drv = NULL;
        return D_BSP_RET_NFCTAG_ERR;
    }
}

extern int32_t bsp_nfc07a1_nfctag_deInit(void)
{
    if (gs_bsp_nfc07a1_handle.p_nfctag_drv != NULL)
    {
        gs_bsp_nfc07a1_handle.p_nfctag_drv = NULL;
        gs_bsp_nfc07a1_handle.nfctag_obj.IsInitialized = 0;
        return D_BSP_RET_OK;
    }
    else
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
}

extern void bsp_nfc07a1_nfctag_isInitialized(uint32_t* const p_isInitialized)
{
    *p_isInitialized = gs_bsp_nfc07a1_handle.nfctag_obj.IsInitialized;
}

extern int32_t bsp_nfc07a1_nfctag_id_read(uint8_t* const wai_id)
{
    if (gs_bsp_nfc07a1_handle.p_nfctag_drv == NULL)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }

    if (gs_bsp_nfc07a1_handle.p_nfctag_drv->ReadID(&(gs_bsp_nfc07a1_handle.nfctag_obj), wai_id) == NFCTAG_OK)
    {
        return D_BSP_RET_OK;
    }
    else
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
}

extern int32_t bsp_nfc07a1_nfctag_it_configure(const uint16_t it_conf)
{
    if (NULL == gs_bsp_nfc07a1_handle.p_nfctag_drv->ConfigIT)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }

    int32_t nfctag_ret = NFCTAG_OK;

