veryneo/stm32_cmake_project/driver/bsp/p_nucleo_wb55/src/bsp_nfc07a1.c
    nfctag_ret = gs_bsp_nfc07a1_handle.p_nfctag_drv->ConfigIT(&(gs_bsp_nfc07a1_handle.nfctag_obj), it_conf);
    if (NFCTAG_OK != nfctag_ret)
    {
    	return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
    	return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_it_status_get(uint16_t* const it_status)
{
    if (gs_bsp_nfc07a1_handle.p_nfctag_drv->GetITStatus == NULL )
    {
        return D_BSP_RET_NFCTAG_ERR;
    }

    if (gs_bsp_nfc07a1_handle.p_nfctag_drv->GetITStatus(&(gs_bsp_nfc07a1_handle.nfctag_obj), it_status) != NFCTAG_OK)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_data_read(uint8_t* const p_data, const uint16_t tar_addr, const uint16_t size)
{
    if (gs_bsp_nfc07a1_handle.p_nfctag_drv->ReadData == NULL )
    {
        return D_BSP_RET_NFCTAG_ERR;
    }

    if (NFCTAG_OK != gs_bsp_nfc07a1_handle.p_nfctag_drv->ReadData(&(gs_bsp_nfc07a1_handle.nfctag_obj), p_data, tar_addr, size) )
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_data_write(const uint8_t* const p_data, const uint16_t tar_addr, const uint16_t size)
{
    if (gs_bsp_nfc07a1_handle.p_nfctag_drv->WriteData == NULL)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }

    if (NFCTAG_OK != gs_bsp_nfc07a1_handle.p_nfctag_drv->WriteData(&(gs_bsp_nfc07a1_handle.nfctag_obj), p_data,tar_addr, size) )
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {        
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_reg_read(uint8_t* const p_data, const uint16_t tar_addr, const uint16_t size)
{
    if (ST25DVxxKC_ReadRegister(&gs_bsp_nfc07a1_handle.nfctag_obj, p_data, tar_addr, size) != NFCTAG_OK)
    { 
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_reg_write(const uint8_t* const p_data, const uint16_t tar_addr, const uint16_t size)
{
    if (ST25DVxxKC_WriteRegister(&gs_bsp_nfc07a1_handle.nfctag_obj, p_data, tar_addr, size) != NFCTAG_OK)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        while(gs_bsp_nfc07a1_handle.p_nfctag_drv->IsReady(&gs_bsp_nfc07a1_handle.nfctag_obj, 1) != NFCTAG_OK ) {};
        
        return D_BSP_RET_OK;
    }  
}

extern int32_t bsp_nfc07a1_nfctag_device_isReady(const uint32_t trials)
{   
    if (gs_bsp_nfc07a1_handle.p_nfctag_drv->IsReady == NULL)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
  
    if (gs_bsp_nfc07a1_handle.p_nfctag_drv->IsReady(&gs_bsp_nfc07a1_handle.nfctag_obj, trials) != NFCTAG_OK)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_i2cPassword_present(const uint32_t password_msb, const uint32_t password_lsb)
{
    ST25DVxxKC_PASSWD_t password = {0};

    password.MsbPasswd = password_msb;
    password.LsbPasswd = password_lsb;
    
    if (ST25DVxxKC_PresentI2CPassword(&gs_bsp_nfc07a1_handle.nfctag_obj, password) != NFCTAG_OK)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get(E_BSP_NFC07A1_NFCTAG_I2C_SS_STATUS_T* const p_ss_status)
{
    if (p_ss_status == NULL)
    {
        return D_BSP_RET_INPUT_ERR;
    }

    ST25DVxxKC_I2CSSO_STATUS_E ss_status = ST25DVXXKC_SESSION_CLOSED;
    
    if (ST25DVxxKC_ReadI2CSecuritySession_Dyn(&gs_bsp_nfc07a1_handle.nfctag_obj, &ss_status) != NFCTAG_OK)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        if (ss_status == ST25DVXXKC_SESSION_CLOSED)
        {
            *p_ss_status = E_BSP_NFC07A1_NFCTAG_I2C_SS_STATUS_CLOSED;
        }
        else if (ss_status == ST25DVXXKC_SESSION_OPEN)
        {
            *p_ss_status = E_BSP_NFC07A1_NFCTAG_I2C_SS_STATUS_OPEN;
        }
        else{}

        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_i2cUsrZone_create(const uint16_t zone1_len, const uint16_t zone2_len, const uint16_t zone3_len, const uint16_t zone4_len)
{
	int32_t nfctag_ret = NFCTAG_OK;

	nfctag_ret = ST25DVxxKC_CreateUserZone(&gs_bsp_nfc07a1_handle.nfctag_obj, zone1_len, zone2_len, zone3_len, zone4_len);
	if (NFCTAG_OK != nfctag_ret)
	{
		return D_BSP_RET_NFCTAG_ERR;
	}
	else
	{
		return D_BSP_RET_OK;
	}
}

extern int32_t bsp_nfc07a1_nfctag_i2cUsrZoneEnd_get(const E_BSP_NFC07A1_NFCTAG_ZONE_END_T zone_end, uint8_t* const p_zone_end)
{
	int32_t nfctag_ret = NFCTAG_OK;

	nfctag_ret = ST25DVxxKC_ReadEndZonex(&gs_bsp_nfc07a1_handle.nfctag_obj, zone_end, p_zone_end);
	if (NFCTAG_OK != nfctag_ret)
	{
		return D_BSP_RET_NFCTAG_ERR;
	}
	else
	{
		return D_BSP_RET_OK;
	}
}

extern int32_t bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set(const E_BSP_NFC07A1_NFCTAG_PROT_ZONE_T zone, const E_BSP_NFC07A1_NFCTAG_PROT_CONF_T prot_conf)
{
    if (ST25DVxxKC_WriteI2CProtectZonex(&gs_bsp_nfc07a1_handle.nfctag_obj, zone, prot_conf) != NFCTAG_OK)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get(const E_BSP_NFC07A1_NFCTAG_PROT_ZONE_T zone, E_BSP_NFC07A1_NFCTAG_PROT_CONF_T* const prot_conf)
{
	ST25DVxxKC_I2C_PROT_ZONE_t st25dv_zone = {0};

	if (ST25DVxxKC_ReadI2CProtectZone(&(gs_bsp_nfc07a1_handle.nfctag_obj), &st25dv_zone) )
	{
		return D_BSP_RET_NFCTAG_ERR;
	}
	else
	{
		switch (zone)
		{
			case E_BSP_NFC07A1_NFCTAG_PROT_ZONE_1:
				*prot_conf = st25dv_zone.ProtectZone1;
				break;
			case E_BSP_NFC07A1_NFCTAG_PROT_ZONE_2:
				*prot_conf = st25dv_zone.ProtectZone2;
				break;
			case E_BSP_NFC07A1_NFCTAG_PROT_ZONE_3:
				*prot_conf = st25dv_zone.ProtectZone3;
				break;
			case E_BSP_NFC07A1_NFCTAG_PROT_ZONE_4:
				*prot_conf = st25dv_zone.ProtectZone4;
				break;
			default:
				*prot_conf = E_BSP_NFC07A1_NFCTAG_PROT_CONF_ERROR;
				break;
		}

		return D_BSP_RET_OK;
	}
}

extern int32_t bsp_nfc07a1_nfctag_i2cUsrMemSize_get(uint32_t* const blk_num, uint32_t* const blk_size)
{
    ST25DVxxKC_MEM_SIZE_t mem_size = {0};

