veryneo/stm32_cmake_project/driver/bsp/p_nucleo_wb55/src/bsp_nfc07a1.c
    if (ST25DVxxKC_ReadMemSize(&gs_bsp_nfc07a1_handle.nfctag_obj, &mem_size) != NFCTAG_OK)
    {
        *blk_num 	=	0;
        *blk_size 	=	0;
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
    	*blk_num	=	mem_size.Mem_Size;
    	*blk_size	=	mem_size.BlockSize;
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_mailboxCtrlDyn_reset()
{
    if (ST25DVxxKC_ResetMBEN_Dyn(&gs_bsp_nfc07a1_handle.nfctag_obj) != NFCTAG_OK)
    {
        return D_BSP_RET_NFCTAG_ERR;
    }
    else
    {
        return D_BSP_RET_OK;
    }
}

extern int32_t bsp_nfc07a1_nfctag_mailboxCtrlDyn_read(uint8_t* const status)
{
	if (!status)
	{
		return D_BSP_RET_INPUT_ERR;
	}

	ST25DVxxKC_EN_STATUS_E st25dvxxkc_status = ST25DVXXKC_ENABLE;

	if (ST25DVxxKC_GetMBEN_Dyn(&gs_bsp_nfc07a1_handle.nfctag_obj, &st25dvxxkc_status) != NFCTAG_OK)
	{
		*status = 0;
		return D_BSP_RET_NFCTAG_ERR;
	}
	else
	{
		*status = st25dvxxkc_status;
		return D_BSP_RET_OK;
	}
}

extern int32_t bsp_nfc07a1_nfctag_lockCCFile_read(uint8_t* const lock0_status, uint8_t* const lock1_status)
{
	if ( (!lock0_status) || (!lock1_status) )
	{
		return D_BSP_RET_INPUT_ERR;
	}

	ST25DVxxKC_LOCK_CCFILE_t st25dvxxkc_lockCCFile = {0};

	if (ST25DVxxKC_ReadLockCCFile(&gs_bsp_nfc07a1_handle.nfctag_obj, &st25dvxxkc_lockCCFile) != NFCTAG_OK)
	{
		*lock0_status = 0;
		*lock1_status = 0;
		return D_BSP_RET_NFCTAG_ERR;
	}
	else
	{
		*lock0_status = st25dvxxkc_lockCCFile.LckBck0;
		*lock1_status = st25dvxxkc_lockCCFile.LckBck1;
		return D_BSP_RET_OK;
	}
}

extern void bsp_nfc07a1_led_init(E_BSP_NFC07A1_LED led)
{
    GPIO_InitTypeDef gpio_initStruct = {0};

    /* Enable the LED GPIO Clock */
    D_BSP_NFC07A1_LEDx_GPIO_CLK_ENABLE(led);

    /* Configure the LED GPIO pin */
    gpio_initStruct.Pin     = gs_bsp_nfc07a1_led_pin[led];
    gpio_initStruct.Mode    = GPIO_MODE_OUTPUT_PP;
    gpio_initStruct.Pull    = GPIO_PULLUP;
    gpio_initStruct.Speed   = GPIO_SPEED_FREQ_VERY_HIGH;

    HAL_GPIO_Init(gs_bsp_nfc07a1_led_port[led], &gpio_initStruct);

    HAL_GPIO_WritePin(gs_bsp_nfc07a1_led_port[led], gs_bsp_nfc07a1_led_pin[led], GPIO_PIN_RESET);   
}

extern void bsp_nfc07a1_led_deinit(E_BSP_NFC07A1_LED led)
{
    /* Turn off LED */
    HAL_GPIO_WritePin(gs_bsp_nfc07a1_led_port[led], gs_bsp_nfc07a1_led_pin[led], GPIO_PIN_RESET);

    /* Deinit the LED GPIO pin */
    HAL_GPIO_DeInit(gs_bsp_nfc07a1_led_port[led], gs_bsp_nfc07a1_led_pin[led]);
}

extern void bsp_nfc07a1_led_on(E_BSP_NFC07A1_LED led)
{
    HAL_GPIO_WritePin(gs_bsp_nfc07a1_led_port[led], gs_bsp_nfc07a1_led_pin[led], GPIO_PIN_SET);
}

extern void bsp_nfc07a1_led_off(E_BSP_NFC07A1_LED led)
{
    HAL_GPIO_WritePin(gs_bsp_nfc07a1_led_port[led], gs_bsp_nfc07a1_led_pin[led], GPIO_PIN_RESET);
}

extern void bsp_nfc07a1_led_toggle(E_BSP_NFC07A1_LED led)
{
    HAL_GPIO_TogglePin(gs_bsp_nfc07a1_led_port[led], gs_bsp_nfc07a1_led_pin[led]);
}

extern void bsp_nfc07a1_led_delay_ms(uint32_t delay)
{
    HAL_Delay(delay);
}

extern void bsp_nfc07a1_gpo_init(void)
{
    GPIO_InitTypeDef gpio_initStruct = {0};

    /* Enable the GPO GPIO Clock */
    D_BSP_NFC07A1_GPO_GPIO_CLK_ENABLE();

    /* Configure the GPO GPIO pin */
    gpio_initStruct.Pin     = D_BSP_NFC07A1_GPO_GPIO_PIN;
    gpio_initStruct.Mode    = GPIO_MODE_IT_RISING;
    gpio_initStruct.Pull    = GPIO_NOPULL;
    gpio_initStruct.Speed   = GPIO_SPEED_FREQ_VERY_HIGH;

    HAL_GPIO_Init(D_BSP_NFC07A1_GPO_GPIO_PORT, &gpio_initStruct);

    HAL_NVIC_SetPriority(D_BSP_NFC07A1_GPO_EXTI_NUM, D_BSP_NFC07A1_GPO_EXTI_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(D_BSP_NFC07A1_GPO_EXTI_NUM);
}

extern void bsp_nfc07a1_gpo_activeFlag_reset(void)
{
    gs_bsp_nfc07a1_handle.gpo_activeFlag = 0;
}

extern void bsp_nfc07a1_gpo_activeFlag_check(uint8_t *p_flag)
{
    *p_flag = gs_bsp_nfc07a1_handle.gpo_activeFlag;
}

extern void HAL_I2C_MspInit(I2C_HandleTypeDef* hi2c)
{
    GPIO_InitTypeDef 			gpio_initStruct 		=	{0};
    RCC_PeriphCLKInitTypeDef 	periphClk_initStruct 	=	{0};
    HAL_StatusTypeDef			hal_ret					=	HAL_OK;

    if (hi2c->Instance == gs_bsp_nfc07a1_handle.i2c_handle.Instance)
    {
    	/* Configure I2C1 Clock */
    	periphClk_initStruct.PeriphClockSelection 	=	RCC_PERIPHCLK_I2C1;
    	periphClk_initStruct.I2c1ClockSelection 	=	RCC_I2C1CLKSOURCE_PCLK1;
	    hal_ret = HAL_RCCEx_PeriphCLKConfig(&periphClk_initStruct);
	    if (HAL_ERROR == hal_ret)
	    {
	    	(void)hal_ret;
	    }

	    __HAL_RCC_GPIOB_CLK_ENABLE();

        /* GPIO Clock enable */
        D_BSP_NFC07A1_I2C_SCL_GPIO_CLK_ENABLE();
        D_BSP_NFC07A1_I2C_SCA_GPIO_CLK_ENABLE(); 
        
        /**
         * NFC Tag I2C GPIO Configuration 
         * PB8 ------> I2C1_SCL
         * PB9 ------> I2C1_SDA   
         */
        gpio_initStruct.Pin = D_BSP_NFC07A1_I2C_SCL_GPIO_PIN;
        gpio_initStruct.Mode = GPIO_MODE_AF_OD;
        gpio_initStruct.Pull = GPIO_PULLUP;
        gpio_initStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        gpio_initStruct.Alternate = D_BSP_NFC07A1_I2C_SCL_GPIO_AF;
        HAL_GPIO_Init(D_BSP_NFC07A1_I2C_SCL_GPIO_PORT, &gpio_initStruct); 

        gpio_initStruct.Pin = D_BSP_NFC07A1_I2C_SCA_GPIO_PIN;
        gpio_initStruct.Mode = GPIO_MODE_AF_OD;
        gpio_initStruct.Pull = GPIO_PULLUP;
        gpio_initStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        gpio_initStruct.Alternate = D_BSP_NFC07A1_I2C_SCA_GPIO_AF;
        HAL_GPIO_Init(D_BSP_NFC07A1_I2C_SCA_GPIO_PORT, &gpio_initStruct);

        /* I2C1 Clock enable */
    	D_BSP_NFC07A1_I2C_CLK_ENABLE();
    }
}

extern void HAL_I2C_MspDeInit(I2C_HandleTypeDef* hi2c)
{
    if (hi2c->Instance == gs_bsp_nfc07a1_handle.i2c_handle.Instance)
    {
        /* Peripheral Clock disable */
        D_BSP_NFC07A1_I2C_CLK_DISABLE();
        D_BSP_NFC07A1_I2C_SCL_GPIO_CLK_DISABLE();
        D_BSP_NFC07A1_I2C_SCA_GPIO_CLK_DISABLE(); 

        /**
         * NFC Tag I2C GPIO Configuration 
         * PB8 ------> I2C1_SCL
         * PB9 ------> I2C1_SDA   
         */
        HAL_GPIO_DeInit(D_BSP_NFC07A1_I2C_SCL_GPIO_PORT, D_BSP_NFC07A1_I2C_SCL_GPIO_PIN);
        HAL_GPIO_DeInit(D_BSP_NFC07A1_I2C_SCA_GPIO_PORT, D_BSP_NFC07A1_I2C_SCA_GPIO_PIN);
    }
}

