veryneo/stm32_cmake_project/driver/bsp/p_nucleo_wb55/src/bsp_nfc07a1.c
extern void EXTI9_5_IRQHandler(void)
{
    HAL_GPIO_EXTI_IRQHandler(D_BSP_NFC07A1_GPO_GPIO_PIN);
}

extern void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (D_BSP_NFC07A1_GPO_GPIO_PIN == GPIO_Pin)
    {
        gs_bsp_nfc07a1_handle.gpo_activeFlag = 1;
    }
}


/**************************************************************
** Function
**************************************************************/

static int32_t bsp_nfc07a1_nfctag_i2C_init(void)
{
    int32_t ret = D_BSP_RET_OK;

    do
    {
        I2C_HandleTypeDef* hi2c1 = &(gs_bsp_nfc07a1_handle.i2c_handle);

        /* I2C Initialization */
    	hi2c1->Instance 				=	D_BSP_NFC07A1_I2C_INSTANCE;
    	hi2c1->Init.Timing 				=	0x00910B1C;
    	hi2c1->Init.OwnAddress1 		=	0;
    	hi2c1->Init.AddressingMode 		=	I2C_ADDRESSINGMODE_7BIT;
    	hi2c1->Init.DualAddressMode 	=	I2C_DUALADDRESS_DISABLE;
    	hi2c1->Init.OwnAddress2 		=	0;
    	hi2c1->Init.OwnAddress2Masks 	=	I2C_OA2_NOMASK;
    	hi2c1->Init.GeneralCallMode 	=	I2C_GENERALCALL_DISABLE;
    	hi2c1->Init.NoStretchMode 		=	I2C_NOSTRETCH_DISABLE;
    	if (HAL_OK != HAL_I2C_Init(hi2c1) )
    	{
    		ret = D_BSP_RET_HAL_ERR;
    		break;
    	}


    	if (HAL_OK != HAL_I2CEx_ConfigAnalogFilter(hi2c1, I2C_ANALOGFILTER_ENABLE) )
    	{
    		ret = D_BSP_RET_HAL_ERR;
    		break;
    	}


    	if (HAL_OK != HAL_I2CEx_ConfigDigitalFilter(hi2c1, 0) )
    	{
    		ret = D_BSP_RET_HAL_ERR;
    		break;
    	}

    	HAL_I2CEx_EnableFastModePlus(I2C_FASTMODEPLUS_I2C1);

        ret = D_BSP_RET_OK;
    } while (0);    

    return ret;
}

static int32_t bsp_nfc07a1_nfctag_i2c_deInit(void)
{
    int32_t ret = D_BSP_RET_OK;

    do
    {
        I2C_HandleTypeDef* hi2c = &(gs_bsp_nfc07a1_handle.i2c_handle);

        /* I2C DeInitialization */
        if (HAL_OK != HAL_I2C_DeInit(hi2c) )
        {
            ret = D_BSP_RET_HAL_ERR;
            break;
        }

        ret = D_BSP_RET_OK;
    } while (0);
    
    return ret;
}

static int32_t bsp_nfc07a1_nfctag_i2c_isReady(uint16_t dev_addr, uint32_t trials)
{
    int32_t ret = D_BSP_RET_OK;

    HAL_StatusTypeDef hal_ret = HAL_OK;
    
    do
    {
        I2C_HandleTypeDef* hi2c = &(gs_bsp_nfc07a1_handle.i2c_handle);

        hal_ret = HAL_I2C_IsDeviceReady(hi2c, dev_addr, trials, D_BSP_I2C_POLL_TIMEOUT);
        if (HAL_OK != hal_ret)
        {
        	ret = D_BSP_RET_HAL_ERR;
        	break;
        }

        ret = D_BSP_RET_OK;
    } while (0);

    return ret;
}

// static int32_t bsp_nfc07a1_nfctag_i2c_reg_write(uint16_t dev_addr, uint16_t reg, uint8_t *p_data, uint16_t length)
// {
//     int32_t ret = D_BSP_RET_OK;

//     HAL_StatusTypeDef   hal_ret         = HAL_OK;
//     int32_t             hal_i2c_errCode = HAL_I2C_ERROR_NONE;

//     do
//     {
//         I2C_HandleTypeDef* hi2c = &(gs_bsp_nfc07a1_handle.i2c_handle);

//         hal_ret = HAL_I2C_Mem_Write(hi2c, dev_addr, reg, I2C_MEMADD_SIZE_8BIT, p_data, length, D_BSP_I2C_POLL_TIMEOUT);
//         if (HAL_OK != hal_ret)
//         {
//             if (HAL_ERROR == hal_ret)
//             {
//                 /* Get the error code */
//                 hal_i2c_errCode = HAL_I2C_GetError(hi2c);
//                 (void)hal_i2c_errCode;
                
//                 ret = D_BSP_RET_HAL_ERR;
//                 break;
//             }
//             else if (HAL_BUSY == hal_ret)
//             {
//                 ret = D_BSP_RET_HAL_BUSY;
//                 break;
//             }
//             else{}
//         }

//         ret = D_BSP_RET_OK;
//     } while (0);

//     return ret;
// }

// static int32_t bsp_nfc07a1_nfctag_i2c_reg_read(uint16_t dev_addr, uint16_t reg, uint8_t *p_data, uint16_t length)
// {
//     int32_t ret = D_BSP_RET_OK;

//     HAL_StatusTypeDef   hal_ret         = HAL_OK;
//     int32_t             hal_i2c_errCode = HAL_I2C_ERROR_NONE;

//     do
//     {
//         I2C_HandleTypeDef* hi2c = &(gs_bsp_nfc07a1_handle.i2c_handle);

//         hal_ret = HAL_I2C_Mem_Read(hi2c, dev_addr, reg, I2C_MEMADD_SIZE_8BIT, p_data, length, D_BSP_I2C_POLL_TIMEOUT);
//         if (HAL_OK != hal_ret)
//         {
//             if (HAL_ERROR == hal_ret)
//             {
//                 /* Get the error code */
//                 hal_i2c_errCode = HAL_I2C_GetError(hi2c);
//                 (void)hal_i2c_errCode;
                
//                 ret = D_BSP_RET_HAL_ERR;
//                 break;
//             }
//             else if (HAL_BUSY == hal_ret)
//             {
//                 ret = D_BSP_RET_HAL_BUSY;
//                 break;
//             }
//             else{}
//         }

//         ret = D_BSP_RET_OK;
//     } while (0);

//     return ret;
// }

static int32_t bsp_nfc07a1_nfctag_i2c_reg16_write(uint16_t dev_addr, uint16_t reg, uint8_t *p_data, uint16_t length)
{
    int32_t ret = D_BSP_RET_OK;

    HAL_StatusTypeDef   hal_ret         = HAL_OK;
    int32_t             hal_i2c_errCode = HAL_I2C_ERROR_NONE;

    do
    {
        I2C_HandleTypeDef* p_hi2c = &(gs_bsp_nfc07a1_handle.i2c_handle);

        hal_ret = HAL_I2C_Mem_Write(p_hi2c, dev_addr, reg, I2C_MEMADD_SIZE_16BIT, p_data, length, D_BSP_I2C_POLL_TIMEOUT);
        if (HAL_OK != hal_ret)
        {
            hal_i2c_errCode = HAL_I2C_GetError(p_hi2c);
            (void)hal_i2c_errCode;

            ret = D_BSP_RET_HAL_ERR;
            break;
        }

        ret = D_BSP_RET_OK;
    } while (0);

    return ret;
}

static int32_t bsp_nfc07a1_nfctag_i2c_reg16_read(uint16_t dev_addr, uint16_t reg, uint8_t *p_data, uint16_t length)
{
    int32_t ret = D_BSP_RET_OK;

    HAL_StatusTypeDef   hal_ret         = HAL_OK;
    int32_t             hal_i2c_errCode = HAL_I2C_ERROR_NONE;

    do
    {
        I2C_HandleTypeDef* p_hi2c = &(gs_bsp_nfc07a1_handle.i2c_handle);

        hal_ret = HAL_I2C_Mem_Read(p_hi2c, dev_addr, reg, I2C_MEMADD_SIZE_16BIT, p_data, length, D_BSP_I2C_POLL_TIMEOUT);
        if (HAL_OK != hal_ret)
        {
            /* Get the error code */
            hal_i2c_errCode = HAL_I2C_GetError(p_hi2c);
            (void)hal_i2c_errCode;

            ret = D_BSP_RET_HAL_ERR;
            break;
        }

        ret = D_BSP_RET_OK;
    } while (0);

    return ret;
}

// static int32_t bsp_nfc07a1_nfctag_i2c_transmit(uint16_t dev_addr, uint8_t *p_data, uint16_t length)
// {
//     int32_t ret = D_BSP_RET_OK;

