veryneo/stm32_cmake_project/driver/bsp/p_nucleo_wb55/src/bsp_nfc07a1.c
//     HAL_StatusTypeDef   hal_ret         = HAL_OK;
//     int32_t             hal_i2c_errCode = HAL_I2C_ERROR_NONE;

//     do
//     {
//         I2C_HandleTypeDef* hi2c = &(gs_bsp_nfc07a1_handle.i2c_handle);

//         hal_ret = HAL_I2C_Master_Transmit(hi2c, dev_addr, p_data, length, D_BSP_I2C_POLL_TIMEOUT);
//         if (HAL_OK != hal_ret)
//         {
//             if (HAL_ERROR == hal_ret)
//             {
//                 /* Get the error code */
//                 hal_i2c_errCode = HAL_I2C_GetError(hi2c);
//                 (void)hal_i2c_errCode;

//                 ret = D_BSP_RET_HAL_ERR;
//                 break;
//             }
//             else if (HAL_BUSY == hal_ret)
//             {
//                 ret = D_BSP_RET_HAL_BUSY;
//                 break;
//             }
//             else{}
//         }

//         ret = D_BSP_RET_OK;
//     } while (0);

//     return ret;
// }

// static int32_t bsp_nfc07a1_nfctag_i2c_receive(uint16_t dev_addr, uint8_t *p_data, uint16_t length)
// {
//     int32_t ret = D_BSP_RET_OK;

//     HAL_StatusTypeDef   hal_ret         = HAL_OK;
//     int32_t             hal_i2c_errCode = HAL_I2C_ERROR_NONE;

//     do
//     {
//         I2C_HandleTypeDef* hi2c = &(gs_bsp_nfc07a1_handle.i2c_handle);

//         hal_ret = HAL_I2C_Master_Receive(hi2c, dev_addr, p_data, length, D_BSP_I2C_POLL_TIMEOUT);
//         if (HAL_OK != hal_ret)
//         {
//             if (HAL_ERROR == hal_ret)
//             {
//                 /* Get the error code */
//                 hal_i2c_errCode = HAL_I2C_GetError(hi2c);
//                 (void)hal_i2c_errCode;
                
//                 ret = D_BSP_RET_HAL_ERR;
//                 break;
//             }
//             else if (HAL_BUSY == hal_ret)
//             {
//                 ret = D_BSP_RET_HAL_BUSY;
//                 break;
//             }
//             else{}
//         }

//         ret = D_BSP_RET_OK;
//     } while (0);

//     return ret;
// }

static int32_t bsp_nfc07a1_nfctag_tick_get(void)
{
    int32_t tick = (int32_t)HAL_GetTick();
    return tick;
}
